import pytest


list_1 = [
    {
        "student_name": "Семенова Елена",
        "subject": "Английский язык",
        "teacher_name": "Ковалева Анна",
        "date": "2023-10-10",
        "grade": "5",
    },
    {
        "student_name": "Титов Владислав",
        "subject": "География",
        "teacher_name": "Орлов Сергей",
        "date": "2023-10-12",
        "grade": "4",
    },
    {
        "student_name": "Иванов Алексей",
        "subject": "Математика",
        "teacher_name": "Петрова Ольга",
        "date": "2023-09-10",
        "grade": "5",
    },
    {
        "student_name": "Семенова Елена",
        "subject": "Физика",
        "teacher_name": "Сидоров Иван",
        "date": "2023-09-12",
        "grade": "4",
    },
]


@pytest.fixture()
def report_1():
    return {"Семенова Елена": [5, 4], "Титов Владислав": [4], "Иванов Алексей": [5]}


dict_1 = {"Семенова Елена": [5, 4], "Титов Владислав": [4], "Иванов Алексей": [5]}


@pytest.fixture()
def table_1():
    return [("Иванов Алексей", 5.0), ("Семенова Елена", 4.5), ("Титов Владислав", 4.0)]
